app/controllers/messages_controller.rb

INSERT INTO "messages" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "flkjdd\r\n"], ["created_at", "2017-11-04 15:37:04.922488"], ["updated_at", "2017-11-04 15:37:04.922488"]]
---
  def create
		@m=Message.new(params.require(:messages).permit(:text))
    @m.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
		@m= Message.find(params[:id])

INSERT INTO "messages" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "{\"message\"=>\"the value of the message\"}"], ["created_at", "2017-11-05 20:41:18.145263"], ["updated_at", "2017-11-05 20:41:18.145263"]]
---
  def api
    json = params.permit(:message)
		@m = Message.new
		@m.text = json
		@m.save